ws/secuencialWS/conecta4.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="conecta4"
  targetNamespace="urn:conecta4ns"
  xmlns:tns="urn:conecta4ns"
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:conecta4ns="urn:conecta4ns"
  xmlns:SOAP="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:HTTP="http://schemas.xmlsoap.org/wsdl/http/"
  xmlns:MIME="http://schemas.xmlsoap.org/wsdl/mime/"
  xmlns:DIME="http://schemas.xmlsoap.org/ws/2002/04/dime/wsdl/"
  xmlns:WSDL="http://schemas.xmlsoap.org/wsdl/"
  xmlns="http://schemas.xmlsoap.org/wsdl/">

<types>

  <schema targetNamespace="urn:conecta4ns"
    xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:conecta4ns="urn:conecta4ns"
    xmlns="http://www.w3.org/2001/XMLSchema"
    elementFormDefault="unqualified"
    attributeFormDefault="unqualified">
    <import namespace="http://schemas.xmlsoap.org/soap/encoding/"/>
    <simpleType name="tPlayer"><!-- conecta4ns__tPlayer -->
      <restriction base="conecta4ns:players">
      </restriction>
    </simpleType>
    <simpleType name="tMove"><!-- conecta4ns__tMove -->
      <restriction base="conecta4ns:moves">
      </restriction>
    </simpleType>
    <complexType name="tMessage"><!-- conecta4ns__tMessage -->
      <complexContent>
        <restriction base="conecta4ns:tMessage">
        </restriction>
      </complexContent>
    </complexType>
    <complexType name="tBlock"><!-- conecta4ns__tBlock -->
      <complexContent>
        <restriction base="conecta4ns:tBlock">
        </restriction>
      </complexContent>
    </complexType>
    <simpleType name="players"><!-- players -->
      <restriction base="xsd:string">
        <enumeration value="player1"/><!-- player1 -->
<!-- = 0 -->
        <enumeration value="player2"/><!-- player2 -->
<!-- = 1 -->
      </restriction>
    </simpleType>
    <simpleType name="moves"><!-- moves -->
      <restriction base="xsd:string">
        <enumeration value="OK-move"/><!-- OK_move -->
<!-- = 0 -->
        <enumeration value="fullColumn-move"/><!-- fullColumn_move -->
<!-- = 1 -->
      </restriction>
    </simpleType>
    <complexType name="tMessage"><!-- tMessage -->
          <sequence>
            <element name="msg" type="xsd:byte" minOccurs="0" maxOccurs="unbounded"/><!-- tMessage::__size -->
          </sequence>
    </complexType>
    <complexType name="tBlock"><!-- tBlock -->
          <sequence>
            <element name="code" type="xsd:unsignedInt" minOccurs="1" maxOccurs="1"/><!-- tBlock::code -->
            <element name="msgStruct" type="conecta4ns:tMessage" minOccurs="1" maxOccurs="1"/><!-- tBlock::msgStruct -->
            <element name="board" type="xsd:byte" minOccurs="0" maxOccurs="unbounded"/><!-- tBlock::__size -->
          </sequence>
    </complexType>
  </schema>

</types>

<message name="registerRequest">
  <part name="playerName" type="conecta4ns:tMessage"/><!-- conecta4ns__register::playerName -->
</message>

<message name="registerResponse">
  <part name="code" type="xsd:int"/><!-- conecta4ns__register::code -->
</message>

<message name="getStatusRequest">
  <part name="playerName" type="conecta4ns:tMessage"/><!-- conecta4ns__getStatus::playerName -->
</message>

<message name="getStatusResponse">
  <part name="status" type="conecta4ns:tBlock"/><!-- conecta4ns__getStatus::status -->
</message>

<message name="insertChipRequest">
  <part name="playerName" type="conecta4ns:tMessage"/><!-- conecta4ns__insertChip::playerName -->
  <part name="playerMove" type="xsd:int"/><!-- conecta4ns__insertChip::playerMove -->
</message>

<message name="insertChipResponse">
  <part name="status" type="conecta4ns:tBlock"/><!-- conecta4ns__insertChip::status -->
</message>

<portType name="conecta4PortType">
  <operation name="register">
    <documentation>Service definition of function conecta4ns__register</documentation>
    <input message="tns:registerRequest"/>
    <output message="tns:registerResponse"/>
  </operation>
  <operation name="getStatus">
    <documentation>Service definition of function conecta4ns__getStatus</documentation>
    <input message="tns:getStatusRequest"/>
    <output message="tns:getStatusResponse"/>
  </operation>
  <operation name="insertChip">
    <documentation>Service definition of function conecta4ns__insertChip</documentation>
    <input message="tns:insertChipRequest"/>
    <output message="tns:insertChipResponse"/>
  </operation>
</portType>

<binding name="conecta4" type="tns:conecta4PortType">
  <SOAP:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
  <operation name="register">
    <SOAP:operation style="rpc" soapAction=""/>
    <input>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </input>
    <output>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </output>
  </operation>
  <operation name="getStatus">
    <SOAP:operation style="rpc" soapAction=""/>
    <input>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </input>
    <output>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </output>
  </operation>
  <operation name="insertChip">
    <SOAP:operation style="rpc" soapAction=""/>
    <input>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </input>
    <output>
          <SOAP:body use="encoded" namespace="urn:conecta4ns" encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"/>
    </output>
  </operation>
</binding>

<service name="conecta4">
  <documentation>gSOAP 2.8.35 generated service definition</documentation>
  <port name="conecta4" binding="tns:conecta4">
    <SOAP:address location="http//localhost:10000"/>
  </port>
</service>

</definitions>
