ws/secuencialWS/conecta4.insertChip.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:conecta4ns="urn:conecta4ns">
 <SOAP-ENV:Body  SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <conecta4ns:insertChip>
   <playerName>
    <msg></msg>
    <msg></msg>
   </playerName>
   <playerMove>0</playerMove>
  </conecta4ns:insertChip>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
